src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание источника в виде структуры для передачи провайдеру.
// Токен читается в привилегированном режиме и в журналы не попадает.
//
// Параметры:
//  ИсточникПакетов - СправочникСсылка.пм_ИсточникиПакетов - Источник.
//
// Возвращаемое значение:
//  Структура - Описание источника:
// * Ссылка - СправочникСсылка.пм_ИсточникиПакетов
// * Наименование - Строка
// * Провайдер - Строка
// * URLСервера - Строка
// * ПутьПроекта - Строка
// * IDПроекта - Строка
// * ФайлКаталога - Строка
// * ВеткаКаталога - Строка
// * ИмяПакета - Строка
// * Токен - Строка
// * РежимОдногоПакета - Булево
//
Функция ОписаниеИсточника(ИсточникПакетов) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникПакетов) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан источник пакетов.'");
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Реквизиты = пм_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИсточникПакетов,
		"Наименование, Провайдер, URLСервера, ПутьПроекта, IDПроекта,
		|ФайлКаталога, ВеткаКаталога, ИмяПакета, ТокенДоступа");

	Описание = НовоеОписаниеИсточника();
	Описание.Ссылка = ИсточникПакетов;
	ЗаполнитьЗначенияСвойств(Описание, Реквизиты);
	Описание.Токен = Реквизиты.ТокенДоступа;
	Описание.РежимОдногоПакета = Не ЗначениеЗаполнено(Реквизиты.ФайлКаталога);

	Возврат Описание;

КонецФункции

// Возвращает пустую структуру описания источника, см. ОписаниеИсточника.
Функция НовоеОписаниеИсточника() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Ссылка", Справочники.пм_ИсточникиПакетов.ПустаяСсылка());
	Описание.Вставить("Наименование", "");
	Описание.Вставить("Провайдер", "");
	Описание.Вставить("URLСервера", "");
	Описание.Вставить("ПутьПроекта", "");
	Описание.Вставить("IDПроекта", "");
	Описание.Вставить("ФайлКаталога", "");
	Описание.Вставить("ВеткаКаталога", "");
	Описание.Вставить("ИмяПакета", "");
	Описание.Вставить("Токен", "");
	Описание.Вставить("РежимОдногоПакета", Ложь);

	Возврат Описание;

КонецФункции

// Сохраняет полученный от провайдера идентификатор проекта, чтобы не
// резолвить его при каждом обращении.
Процедура ЗапомнитьIDПроекта(ИсточникПакетов, IDПроекта) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникПакетов) Или Не ЗначениеЗаполнено(IDПроекта) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Объект = ИсточникПакетов.ПолучитьОбъект();
	Если Объект.IDПроекта = Строка(IDПроекта) Тогда
		Возврат;
	КонецЕсли;

	Объект.IDПроекта = Строка(IDПроекта);
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();

КонецПроцедуры

// Записывает текст последней ошибки обращения к источнику.
Процедура ЗапомнитьОшибку(ИсточникПакетов, ТекстОшибки) Экспорт

	Если Не ЗначениеЗаполнено(ИсточникПакетов) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Объект = ИсточникПакетов.ПолучитьОбъект();
	Если Объект.ТекстОшибки = ТекстОшибки Тогда
		Возврат;
	КонецЕсли;

	Объект.ТекстОшибки = ТекстОшибки;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
